[
  {
    "Category": "Metabolic & Endocrine",
    "Disorder Name": "Diabetes Mellitus (Type 1 & 2)",
    "Definition / Etiology": "Chronic hyperglycemia due to insulin deficiency (Type1) or insulin resistance + relative deficiency (Type2).",
    "Clinical Goals": "Achieve glycemic control, prevent complications, maintain healthy weight and lipid profile.",
    "MNT - Macronutrients": "Carbs 45/50% (low-GI), Protein 1.0/1.2 g/kg, Fat 20/30% (MUFA/PUFA).",
    "MNT - Micronutrients": "Chromium, Magnesium, Zinc, Vitamin D, B-complex, Omega-3.",
    "MNT - Fluids & Electrolytes": "Adequate hydration; avoid sugary drinks; monitor electrolytes if on diuretics.",
    "MNT - Special Notes": "Emphasize fiber, low GI, timed meals, carbohydrate counting where needed.",
    "Ayurvedic View": "Kapha/Pitta imbalance; bitter, astringent foods helpful; spices: cinnamon, fenugreek.",
    "Dosha Dominance": "Kapha + Pitta",
    "Lifestyle & Yogic Guidance": "Walk 30/45 min daily, resistance training twice weekly, pranayama (Anulom Vilom).",
    "Healing Affirmation": "Affirmation: I allow the sweetness of life to flow through me. I balance my body with calm action."
  },
  {
    "Category": "Metabolic & Endocrine",
    "Disorder Name": "Obesity / Weight Management",
    "Definition / Etiology": "Excess adipose tissue due to chronic positive energy balance influenced by diet, activity, genetics.",
    "Clinical Goals": "Achieve gradual weight loss, preserve lean mass, improve metabolic health.",
    "MNT - Macronutrients": "Calorie deficit ~500 kcal/day; Protein 1/1.2 g/kg; Carbs 45/50% complex; Fat 25/30%.",
    "MNT - Micronutrients": "Vitamin D, B12, Magnesium, Iron (if deficient), Omega-3.",
    "MNT - Fluids & Electrolytes": "Hydrate well; avoid sugary beverages; monitor electrolytes during weight loss.",
    "MNT - Special Notes": "Focus on portion control, high protein for satiety, fibre-rich meals, behavioral strategies.",
    "Ayurvedic View": "Kapha predominance; bitter, pungent tastes reduce Kapha; use trikatu in small amounts.",
    "Dosha Dominance": "Kapha",
    "Lifestyle & Yogic Guidance": "45/60 min daily activity (mix cardio + strength), sleep 7/8 hrs, mindful eating.",
    "Healing Affirmation": "Affirmation: I lovingly release what no longer serves me. I am light and capable."
  },
  {
    "Category": "Metabolic & Endocrine",
    "Disorder Name": "PCOS / PCOD",
    "Definition / Etiology": "Hormonal disorder with hyperandrogenism, ovarian dysfunction and often insulin resistance.",
    "Clinical Goals": "Improve insulin sensitivity, balance hormones, support ovulation and weight management.",
    "MNT - Macronutrients": "Carbs 40/45% low-GI, Protein 1.0/1.2 g/kg, Fat 25/30% with omega-3s.",
    "MNT - Micronutrients": "Vitamin D, Inositol, Chromium, Magnesium, Zinc, Omega-3.",
    "MNT - Fluids & Electrolytes": "Adequate fluids; reduce sugary drinks; avoid excessive caffeine.",
    "MNT - Special Notes": "Prioritize low-GI foods, regular meals, and anti-inflammatory nutrients.",
    "Ayurvedic View": "Kapha/Vata imbalance; include flaxseed, fenugreek, spearmint tea.",
    "Dosha Dominance": "Kapha + Vata",
    "Lifestyle & Yogic Guidance": "45 min activity, strength training, yoga (Baddha Konasana), stress reduction.",
    "Healing Affirmation": "Affirmation: My body is in perfect rhythm. I nurture my feminine energy with patience."
  },
  {
    "Category": "Metabolic & Endocrine",
    "Disorder Name": "Thyroid Disorders (Hypothyroidism & Hyperthyroidism)",
    "Definition / Etiology": "Underactive or overactive thyroid affecting metabolism, energy and growth.",
    "Clinical Goals": "Normalize thyroid function, address symptoms (weight, fatigue), ensure nutrient support.",
    "MNT - Macronutrients": "Hypo: Calorie control, Protein 1/1.2 g/kg; Hyper: higher calories as needed, Protein 1.2 g/kg.",
    "MNT - Micronutrients": "Iodine (adequate), Selenium, Zinc, Iron, Vitamin D, B12.",
    "MNT - Fluids & Electrolytes": "Hydration as per symptoms; monitor electrolytes with meds.",
    "MNT - Special Notes": "Avoid goitrogens raw for hypothyroid; time meds on empty stomach; monitor interactions.",
    "Ayurvedic View": "Vata/Kapha in hypothyroid; Pitta in hyperthyroid. Use warming herbs for hypo, cooling for hyper.",
    "Dosha Dominance": "Vata + Kapha (hypo); Pitta (hyper)",
    "Lifestyle & Yogic Guidance": "Thyroid meds 30/60 min before food, gentle yoga (Sarvangasana with guidance), stress management.",
    "Healing Affirmation": "Affirmation: I am in alignment with my inner rhythm. My body finds balance and expression."
  },
  {
    "Category": "Metabolic & Endocrine",
    "Disorder Name": "Metabolic Syndrome",
    "Definition / Etiology": "Cluster of conditions: central obesity, hypertension, dyslipidemia, insulin resistance increasing CVD risk.",
    "Clinical Goals": "Reverse components: reduce waist/weight, improve lipids, control BP and glucose.",
    "MNT - Macronutrients": "Calorie control, Protein 1/1.2 g/kg, low-GI carbs, healthy fats (MUFA/PUFA).",
    "MNT - Micronutrients": "Omega-3, Magnesium, Vitamin D, B-complex.",
    "MNT - Fluids & Electrolytes": "Reduce alcohol; hydrate; limit sugary fluids.",
    "MNT - Special Notes": "Lifestyle = cornerstone: diet, activity, sleep, stress reduction.",
    "Ayurvedic View": "Kapha/Pitta features; anti-inflammatory diet and spices like turmeric help.",
    "Dosha Dominance": "Kapha + Pitta",
    "Lifestyle & Yogic Guidance": "Regular aerobic + resistance training, sleep, reduce stress, avoid tobacco.",
    "Healing Affirmation": "Affirmation: I restore balance to my metabolism. My body works with me."
  },
  {
    "Category": "Cardiovascular & Circulatory",
    "Disorder Name": "Cardiovascular Disease / Dyslipidemia",
    "Definition / Etiology": "Abnormal lipid levels and atherosclerosis increasing heart disease risk.",
    "Clinical Goals": "Lower LDL/TG, raise HDL, reduce inflammation and CVD risk.",
    "MNT - Macronutrients": "Carbs 45/50%, Protein 0.8/1.2 g/kg, Fat 20/30% (limit sat & trans).",
    "MNT - Micronutrients": "Omega-3, Niacin (B3), Magnesium, Vitamin D, CoQ10.",
    "MNT - Fluids & Electrolytes": "Hydration healthy; limit alcohol; avoid trans-fat containing foods.",
    "MNT - Special Notes": "Include soluble fiber, plant sterols, nuts; avoid processed snacks.",
    "Ayurvedic View": "Pitta/Kapha imbalance; garlic, guggul (supervision), flaxseed.",
    "Dosha Dominance": "Pitta + Kapha",
    "Lifestyle & Yogic Guidance": "Cardio + resistance; stress reduction; no smoking; heart opening yoga.",
    "Healing Affirmation": "Affirmation: My heart is strong and steady. I nourish it with wise choices."
  },
  {
    "Category": "Cardiovascular & Circulatory",
    "Disorder Name": "Hypertension",
    "Definition / Etiology": "Persistently elevated blood pressure increasing risk of stroke, heart disease and kidney disease.",
    "Clinical Goals": "Lower BP, reduce sodium, improve vascular health and weight.",
    "MNT - Macronutrients": "Balanced macronutrients; DASH-style: fruits, veg, low-fat dairy, whole grains.",
    "MNT - Micronutrients": "Potassium, Magnesium, Calcium, Vitamin D, Omega-3.",
    "MNT - Fluids & Electrolytes": "Sodium <1500/2000 mg/day, adequate hydration; monitor diuretics.",
    "MNT - Special Notes": "Reduce salt, increase potassium-rich foods, DASH dietary pattern.",
    "Ayurvedic View": "Pitta + Vata influences; cooling foods like coriander, amla helpful.",
    "Dosha Dominance": "Pitta + Vata",
    "Lifestyle & Yogic Guidance": "Regular aerobic exercise, deep breathing, yoga (Savasana, Shitali), reduce stress.",
    "Healing Affirmation": "Affirmation: Calmness flows through every beat of my heart. I release tension."
  },
  {
    "Category": "Cardiovascular & Circulatory",
    "Disorder Name": "Hypotension (Low Blood Pressure)",
    "Definition / Etiology": "Low BP causing dizziness, weakness; due to dehydration, anemia, endocrine causes or medications.",
    "Clinical Goals": "Restore intravascular volume, optimize electrolytes, address underlying causes.",
    "MNT - Macronutrients": "Ensure adequate carbs and balanced meals; moderate protein 0.8/1.0 g/kg.",
    "MNT - Micronutrients": "Iron (if anemic), B12, Folate, Electrolytes (sodium as needed).",
    "MNT - Fluids & Electrolytes": "Increase fluids, electrolyte-containing drinks, small frequent meals.",
    "MNT - Special Notes": "Avoid sudden posture changes; add modest salt if clinically appropriate.",
    "Ayurvedic View": "Vata imbalance (often) with low ojas; warming, nourishing foods (ghee, warm soups).",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Gentle inversions under guidance, pranayama for grounding (Bhramari), slow posture changes.",
    "Healing Affirmation": "Affirmation: I am steady, grounded, and supported. My circulation flows with ease."
  },
  {
    "Category": "Cardiovascular & Circulatory",
    "Disorder Name": "Anemia (Nutritional)",
    "Definition / Etiology": "Low hemoglobin due to iron, B12 or folate deficiency or chronic disease.",
    "Clinical Goals": "Restore hemoglobin and iron stores, correct deficiencies, improve energy.",
    "MNT - Macronutrients": "Adequate calories, Protein 1.0/1.2 g/kg to support erythropoiesis.",
    "MNT - Micronutrients": "Iron, Vitamin B12, Folate, Vitamin C to aid absorption, Copper.",
    "MNT - Fluids & Electrolytes": "Hydration adequate; avoid tea/coffee with iron-rich meals.",
    "MNT - Special Notes": "Enhance iron absorption (vitamin C), use cast-iron cookware, check for malabsorption.",
    "Ayurvedic View": "Vata + Pitta tendencies; use amla, sesame, pippali to support digestion and blood.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Gentle strengthening, regular meals, abdominal massage to improve digestion.",
    "Healing Affirmation": "Affirmation: My blood renews and nourishes every cell. I am full of life."
  },
  {
    "Category": "Digestive & Gastrointestinal",
    "Disorder Name": "Gastrointestinal Disorders (IBS / GERD / Constipation)",
    "Definition / Etiology": "Functional or structural GI conditions causing pain, altered bowel habits and reflux.",
    "Clinical Goals": "Relieve symptoms, restore gut motility and microbiome, correct deficiencies.",
    "MNT - Macronutrients": "Protein 1.0/1.2 g/kg; Carbs 45/55% adjusted for FODMAP sensitivity; Fat 20/30%.",
    "MNT - Micronutrients": "Vitamin D, B12 (if malabsorption), Zinc, Electrolytes; Prebiotic fiber.",
    "MNT - Fluids & Electrolytes": "Hydration important; avoid carbonated drinks for GERD.",
    "MNT - Special Notes": "Personalize FODMAP, increase soluble fiber for constipation, probiotic foods as tolerated.",
    "Ayurvedic View": "Vata (constipation), Pitta (GERD), Kapha (sluggish digestion); use ginger, fennel.",
    "Dosha Dominance": "Vata / Pitta / Kapha (depending on subtype)",
    "Lifestyle & Yogic Guidance": "Mindful eating, abdominal massage, pranayama, regular routine.",
    "Healing Affirmation": "Affirmation: My digestion processes life with ease and calm."
  },
  {
    "Category": "Digestive & Gastrointestinal",
    "Disorder Name": "Celiac Disease / Gluten Sensitivity",
    "Definition / Etiology": "Immune-mediated enteropathy triggered by gluten in genetically susceptible individuals.",
    "Clinical Goals": "Complete gluten elimination, heal intestinal mucosa, correct nutrient deficiencies.",
    "MNT - Macronutrients": "Gluten-free carbs (rice, millets, quinoa), Protein 1.0/1.2 g/kg, Fat 25/30%.",
    "MNT - Micronutrients": "Iron, Folate, B12, Vitamin D, Calcium, Zinc.",
    "MNT - Fluids & Electrolytes": "Hydration as needed; avoid lactose if secondary intolerance present.",
    "MNT - Special Notes": "Strict lifelong gluten-free diet, prevent cross-contamination, supplement deficiencies.",
    "Ayurvedic View": "Vata + Pitta tendencies; soothing foods like ghee, ginger, cumin.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Regular meals, avoid stress, gut-healing herbs, mindful eating.",
    "Healing Affirmation": "Affirmation: My gut is calm and healed. I accept nourishing foods with ease."
  },
  {
    "Category": "Digestive & Gastrointestinal",
    "Disorder Name": "Peptic Ulcer Disease (PUD)",
    "Definition / Etiology": "Mucosal erosion usually due to H. pylori infection or NSAID use causing epigastric pain.",
    "Clinical Goals": "Promote healing of gastric mucosa, reduce acid-related damage, ensure adequate nutrition.",
    "MNT - Macronutrients": "Balanced macronutrients; avoid very spicy/fatty meals that irritate mucosa.",
    "MNT - Micronutrients": "Vitamin A, C, Zinc, Vitamin B12 if needed.",
    "MNT - Fluids & Electrolytes": "Avoid irritants like alcohol; small frequent meals may help.",
    "MNT - Special Notes": "Avoid NSAIDs, incorporate mucoprotective foods (yogurt, ghrita where appropriate).",
    "Ayurvedic View": "Pitta imbalance likely; cooling, soothing foods like aloe, coriander.",
    "Dosha Dominance": "Pitta",
    "Lifestyle & Yogic Guidance": "Stress reduction, pranayama, avoid late-night eating, soothe digestive fire.",
    "Healing Affirmation": "Affirmation: My inner lining heals gently and I am protected."
  },
  {
    "Category": "Digestive & Gastrointestinal",
    "Disorder Name": "Inflammatory Bowel Disease (Crohn's Disease & Ulcerative Colitis)",
    "Definition / Etiology": "Chronic inflammatory disorders of the GI tract causing malabsorption and systemic symptoms.",
    "Clinical Goals": "Control inflammation, maintain nutrition, prevent malnutrition and deficiencies.",
    "MNT - Macronutrients": "Energy as needed; Protein 1.2/1.5 g/kg in active disease, adjust carbs and fat per tolerance.",
    "MNT - Micronutrients": "Iron, B12, Folate, Vitamin D, Zinc, Electrolytes.",
    "MNT - Fluids & Electrolytes": "Hydration crucial; replace losses in diarrhea with ORS solutions.",
    "MNT - Special Notes": "Tailor fiber and fat during flares, use easily digestible, nutrient-dense foods.",
    "Ayurvedic View": "Vata/Pitta imbalance with inflammation; cooling herbs, ghee for nutrition.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Stress reduction, gentle yoga, medical coordination, avoid trigger foods.",
    "Healing Affirmation": "Affirmation: My gut is protected and nourished. I reclaim peaceful digestion."
  },
  {
    "Category": "Liver & Hepatic",
    "Disorder Name": "Liver Cirrhosis",
    "Definition / Etiology": "Chronic liver scarring and impaired function from alcohol, hepatitis or NAFLD progression.",
    "Clinical Goals": "Prevent further damage, maintain nutrition, manage complications (ascites, encephalopathy).",
    "MNT - Macronutrients": "Energy 30/35 kcal/kg if malnourished; Protein 1.0/1.2 g/kg (modify in encephalopathy).",
    "MNT - Micronutrients": "B-complex, Vitamin D, Vitamin K, Zinc, Selenium.",
    "MNT - Fluids & Electrolytes": "Fluid & sodium management if ascites; monitor electrolytes.",
    "MNT - Special Notes": "Small frequent meals, avoid alcohol, treat malabsorption, consider MCTs if needed.",
    "Ayurvedic View": "Pitta + Kapha imbalance; use turmeric, coriander, amla cautiously.",
    "Dosha Dominance": "Pitta + Kapha",
    "Lifestyle & Yogic Guidance": "Early sleep, gentle yoga, avoid toxins, liver-supporting herbs under guidance.",
    "Healing Affirmation": "Affirmation: My liver regenerates with ease. I release what no longer serves me."
  },
  {
    "Category": "Liver & Hepatic",
    "Disorder Name": "Fatty Liver Disease (NAFLD)",
    "Definition / Etiology": "Excess fat accumulation in liver cells linked to obesity and insulin resistance.",
    "Clinical Goals": "Reduce liver fat, improve insulin sensitivity, achieve gradual weight loss.",
    "MNT - Macronutrients": "Energy 20/25 kcal/kg for weight loss; Protein 1.0/1.2 g/kg; Fat 20/25% (limit sat/trans).",
    "MNT - Micronutrients": "Vitamin E (where indicated), Vitamin D, Omega-3, Selenium.",
    "MNT - Fluids & Electrolytes": "Hydration, avoid sugary drinks and fructose.",
    "MNT - Special Notes": "Avoid fructose, emphasize antioxidants and fiber, regular exercise.",
    "Ayurvedic View": "Kapha + Pitta features; turmeric, green tea, garlic supportive.",
    "Dosha Dominance": "Kapha + Pitta",
    "Lifestyle & Yogic Guidance": "20-min post-meal walk, avoid late-night eating, moderate exercise.",
    "Healing Affirmation": "Affirmation: I release heaviness and embrace renewal in my body."
  },
  {
    "Category": "Liver & Hepatic",
    "Disorder Name": "Hepatitis (Viral / Alcoholic)",
    "Definition / Etiology": "Inflammation of the liver due to viral infection or toxins like alcohol.",
    "Clinical Goals": "Support liver healing, maintain nutrition during recovery, prevent progression.",
    "MNT - Macronutrients": "Adequate calories and protein 1.0/1.2 g/kg; adjust per tolerance.",
    "MNT - Micronutrients": "B-complex, Vitamin K, Vitamin D, Zinc, Selenium.",
    "MNT - Fluids & Electrolytes": "Hydration, avoid alcohol and hepatotoxic substances.",
    "MNT - Special Notes": "Antioxidant-rich diet, small frequent meals during nausea.",
    "Ayurvedic View": "Pitta aggravation; cooling foods, amla, coriander, avoid heated spices.",
    "Dosha Dominance": "Pitta",
    "Lifestyle & Yogic Guidance": "Rest, avoid alcohol, light movement as tolerated, herbs with supervision.",
    "Healing Affirmation": "Affirmation: I support my liver with gentle care and patience."
  },
  {
    "Category": "Renal & Urinary",
    "Disorder Name": "Chronic Kidney Disease (CKD)",
    "Definition / Etiology": "Progressive loss of renal function leading to waste accumulation and electrolyte imbalance.",
    "Clinical Goals": "Slow progression, maintain nutrition, manage uremia, control electrolytes & BP.",
    "MNT - Macronutrients": "Energy 30/35 kcal/kg; Protein 0.6/0.8 g/kg (pre-dialysis) or 1.0/1.2 g/kg (on dialysis).",
    "MNT - Micronutrients": "Vitamin D (activated), B-complex, Iron (as needed), Zinc.",
    "MNT - Fluids & Electrolytes": "Fluid restriction per output; monitor sodium, potassium, phosphorus.",
    "MNT - Special Notes": "Leach high-potassium vegs, limit phosphorus-rich foods, individualized protein plan.",
    "Ayurvedic View": "Vata + Kapha features; coriander water, punarnava supportive herbs.",
    "Dosha Dominance": "Vata + Kapha",
    "Lifestyle & Yogic Guidance": "BP control, avoid NSAIDs, gentle yoga, monitor fluid intake and weight.",
    "Healing Affirmation": "Affirmation: I am balanced and supported. My body receives the care it needs."
  },
  {
    "Category": "Renal & Urinary",
    "Disorder Name": "Renal Calculi (Kidney Stones)",
    "Definition / Etiology": "Crystallization of minerals in the urinary tract due to dehydration, dietary factors or metabolic issues.",
    "Clinical Goals": "Prevent recurrence, reduce stone-forming factors, maintain hydration.",
    "MNT - Macronutrients": "Balanced macronutrients; avoid excessive animal protein if uric acid stones.",
    "MNT - Micronutrients": "Depending on type: calcium, citrate adjustments; ensure vitamin D adequacy.",
    "MNT - Fluids & Electrolytes": "3/4 L fluids/day, citrus drinks to increase urinary citrate.",
    "MNT - Special Notes": "Limit oxalate or purine-rich foods based on stone type; moderate calcium intake.",
    "Ayurvedic View": "Pitta/Vata tendencies; coriander, gokshura supportive.",
    "Dosha Dominance": "Pitta + Vata",
    "Lifestyle & Yogic Guidance": "Hydration, avoid high-oxalate diet if susceptible, moderate salt intake.",
    "Healing Affirmation": "Affirmation: I release blockages and flow with ease and lightness."
  },
  {
    "Category": "Renal & Urinary",
    "Disorder Name": "Nephrotic Syndrome",
    "Definition / Etiology": "A kidney disorder causing heavy proteinuria, hypoalbuminemia, edema and hyperlipidemia.",
    "Clinical Goals": "Reduce protein loss, control edema, ensure adequate nutrition and manage lipids.",
    "MNT - Macronutrients": "Protein moderate 0.8/1.0 g/kg (adjust per physician), calories sufficient 30 kcal/kg.",
    "MNT - Micronutrients": "Albumin support nutrients: Zinc, Vitamin D, B-complex, Iron if anemic.",
    "MNT - Fluids & Electrolytes": "Sodium restriction to control edema; fluid management as needed.",
    "MNT - Special Notes": "Manage protein intake per renal team; address hyperlipidemia with healthy fats.",
    "Ayurvedic View": "Vata/Kapha imbalance; use punarnava and diuretic-supportive herbs under guidance.",
    "Dosha Dominance": "Vata + Kapha",
    "Lifestyle & Yogic Guidance": "Monitor weight, limb elevation for edema, gentle activity, low-sodium diet.",
    "Healing Affirmation": "Affirmation: My body restores balance and I am supported in healing."
  },
  {
    "Category": "Bone & Musculoskeletal",
    "Disorder Name": "Osteoporosis",
    "Definition / Etiology": "Reduced bone mass and structural deterioration increasing fracture risk.",
    "Clinical Goals": "Maintain bone density, prevent fractures, correct calcium & vitamin D deficiency.",
    "MNT - Macronutrients": "Protein 1.0/1.2 g/kg; Calcium-rich foods; balanced carbs & fats.",
    "MNT - Micronutrients": "Calcium, Vitamin D, Magnesium, Vitamin K2, Zinc.",
    "MNT - Fluids & Electrolytes": "Hydration normal; avoid excess caffeine which may affect calcium.",
    "MNT - Special Notes": "Weight-bearing exercise, ensure adequate calcium + vitamin D and protein.",
    "Ayurvedic View": "Vata imbalance; warming nourishing foods like sesame, dates, ghee.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Sunlight 20 min/day, resistance training, yoga for balance (Tadasana).",
    "Healing Affirmation": "Affirmation: My bones are strong, grounded, and full of light."
  },
  {
    "Category": "Bone & Musculoskeletal",
    "Disorder Name": "Osteomalacia",
    "Definition / Etiology": "Softening of bones due to Vitamin D deficiency leading to bone pain and weakness.",
    "Clinical Goals": "Restore vitamin D and calcium, relieve pain, improve mobility.",
    "MNT - Macronutrients": "Adequate calories and protein for repair.",
    "MNT - Micronutrients": "Vitamin D, Calcium, Phosphate, Magnesium.",
    "MNT - Fluids & Electrolytes": "Hydration normal; sunlight exposure encouraged.",
    "MNT - Special Notes": "Supplement vitamin D under supervision, safe sun exposure, dietary calcium.",
    "Ayurvedic View": "Vata imbalance with weakness; sesame, ghee, warm milk supportive.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Sunlight, gentle strengthening exercises, avoid rapid weight-bearing progression.",
    "Healing Affirmation": "Affirmation: Sunlight nourishes my bones and I grow stronger each day."
  },
  {
    "Category": "Bone & Musculoskeletal",
    "Disorder Name": "Arthritis / Gout",
    "Definition / Etiology": "Joint inflammation; gout due to uric acid crystal deposition; OA due to wear and tear.",
    "Clinical Goals": "Reduce inflammation, control uric acid for gout, maintain mobility and weight.",
    "MNT - Macronutrients": "Protein ~1.0 g/kg; reduce purine-rich animal protein for gout; balanced carbs & fats.",
    "MNT - Micronutrients": "Omega-3, Vitamin D, Calcium, Magnesium, Vitamin C.",
    "MNT - Fluids & Electrolytes": "Hydration important to flush uric acid; limit alcohol.",
    "MNT - Special Notes": "Anti-inflammatory diet: turmeric, ginger, omega-3s; weight management for OA.",
    "Ayurvedic View": "Vata/Kapha and Pitta for inflammatory patterns; use ashwagandha, guggul.",
    "Dosha Dominance": "Vata + Kapha",
    "Lifestyle & Yogic Guidance": "Gentle mobility exercises, oil massage, warm compresses, anti-inflammatory yoga.",
    "Healing Affirmation": "Affirmation: I move with ease and grace. My joints are supported and calm."
  },
  {
    "Category": "Immunity & Cancer",
    "Disorder Name": "Cancer Nutrition (General MNT)",
    "Definition / Etiology": "Nutritional support during and after cancer treatment to preserve lean mass and support immunity.",
    "Clinical Goals": "Prevent/treat malnutrition, support healing, manage treatment side-effects.",
    "MNT - Macronutrients": "Energy 30/35 kcal/kg; Protein 1.2/1.5 g/kg; adapt carbs/fat per tolerance.",
    "MNT - Micronutrients": "Vitamin D, Zinc, Selenium, Vitamin C, B-complex, Omega-3.",
    "MNT - Fluids & Electrolytes": "Hydration, small frequent nutrient-dense fluids; manage electrolytes.",
    "MNT - Special Notes": "Soft, nutrient-dense meals, focus on antioxidants and easy-to-eat foods during mucositis.",
    "Ayurvedic View": "Vata + Pitta often affected; nourishing herbs like ashwagandha, amla supportive.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Gentle yoga, pranayama, rest, counseling and gradual activity return.",
    "Healing Affirmation": "Affirmation: Each cell in my body vibrates with vitality and healing energy."
  },
  {
    "Category": "Immunity & Cancer",
    "Disorder Name": "COVID Recovery / Immunity Nutrition",
    "Definition / Etiology": "Post-viral recovery emphasizing restoration of strength, lung function and immune resilience.",
    "Clinical Goals": "Rebuild strength, restore immunity, reduce inflammation and fatigue.",
    "MNT - Macronutrients": "Energy 30/35 kcal/kg; Protein 1.2/1.5 g/kg; balanced carbs & fats.",
    "MNT - Micronutrients": "Vitamin C, D, Zinc, Selenium, B-complex, Iron if needed.",
    "MNT - Fluids & Electrolytes": "Hydration, warm fluids, electrolytes as needed.",
    "MNT - Special Notes": "Protein each meal, antioxidant-rich foods, gradual progressive physical rehab.",
    "Ayurvedic View": "Vata + Pitta tendencies; tulsi, mulethi, turmeric supportive.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Pranayama for lung health (Anulom Vilom), gradual walking program, sunlight.",
    "Healing Affirmation": "Affirmation: My breath flows freely. I am renewed and strong."
  },
  {
    "Category": "Immunity & Cancer",
    "Disorder Name": "Autoimmune Disorders (e.g., Hashimoto's, RA, Lupus)",
    "Definition / Etiology": "Immune system attacks self-tissue; multi-system symptoms requiring individualized MNT.",
    "Clinical Goals": "Reduce inflammation, support immune regulation, correct deficiencies.",
    "MNT - Macronutrients": "Anti-inflammatory macronutrient balance; focus on adequate protein and healthy fats.",
    "MNT - Micronutrients": "Vitamin D, Omega-3, Zinc, Selenium, B12 as indicated.",
    "MNT - Fluids & Electrolytes": "Hydration, avoid triggers; monitor electrolytes with meds.",
    "MNT - Special Notes": "Elimination diets if indicated, anti-inflammatory foods, gut-support strategies.",
    "Ayurvedic View": "Pitta/Vata or Pitta/Kapha depending on disease; turmeric, guduchi under guidance.",
    "Dosha Dominance": "Pitta + Vata",
    "Lifestyle & Yogic Guidance": "Stress reduction, restorative yoga, gentle detoxification under supervision.",
    "Healing Affirmation": "Affirmation: My immune system is wise and balanced. I honor my body's signals."
  },
  {
    "Category": "Mind-Body & Behavioral",
    "Disorder Name": "Eating Disorders (Anorexia Nervosa / Bulimia Nervosa)",
    "Definition / Etiology": "Psychiatric conditions with disturbed eating behavior and body image issues.",
    "Clinical Goals": "Restore safe eating patterns, normalize weight and nutrients, address psychological factors.",
    "MNT - Macronutrients": "Gradual refeeding with energy 30/40 kcal/kg supervised; Protein 1.2/1.5 g/kg.",
    "MNT - Micronutrients": "B vitamins, Zinc, Vitamin D, Iron as indicated; electrolytes monitoring in bulimia.",
    "MNT - Fluids & Electrolytes": "Hydration; monitor electrolytes especially with purging behaviors.",
    "MNT - Special Notes": "Multidisciplinary care: dietitian, therapist, medical monitoring for refeeding syndrome.",
    "Ayurvedic View": "Vata + Pitta imbalances; grounding, warm, nourishing foods, ghee, dates.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Mindful eating, therapy, family support, gentle movement, journaling.",
    "Healing Affirmation": "Affirmation: I honor my body and nourish it with love. I am safe to receive."
  },
  {
    "Category": "Mind-Body & Behavioral",
    "Disorder Name": "Stress & Emotional Eating",
    "Definition / Etiology": "Eating in response to stress or emotions leading to weight fluctuation and metabolic impact.",
    "Clinical Goals": "Develop coping strategies, stabilize blood sugar, build mindful eating habits.",
    "MNT - Macronutrients": "Balanced macronutrients to stabilize glucose; protein at each meal; fiber-rich carbs.",
    "MNT - Micronutrients": "Magnesium, B-complex, Vitamin D, Omega-3.",
    "MNT - Fluids & Electrolytes": "Hydration to reduce cravings; avoid alcohol as coping mechanism.",
    "MNT - Special Notes": "Behavioral strategies, identify triggers, structured meals/snacks.",
    "Ayurvedic View": "Vata or Kapha patterns; calming herbs like tulsi and ashwagandha.",
    "Dosha Dominance": "Vata or Kapha",
    "Lifestyle & Yogic Guidance": "Stress management (meditation, breathwork), sleep hygiene, supportive community.",
    "Healing Affirmation": "Affirmation: I meet my feelings with compassion and choose nourishing foods."
  },
  {
    "Category": "Mind-Body & Behavioral",
    "Disorder Name": "Depression / Nutrition Link",
    "Definition / Etiology": "Mood disorders influenced by inflammation, neurotransmitter imbalance and nutrition.",
    "Clinical Goals": "Support mood with diet, correct deficiencies, support sleep and energy.",
    "MNT - Macronutrients": "Omega-3 rich fats, adequate protein, whole grains, regular meals.",
    "MNT - Micronutrients": "B12, Folate, Vitamin D, Magnesium, Zinc, Omega-3.",
    "MNT - Fluids & Electrolytes": "Hydration supports cognition; avoid excess caffeine before bed.",
    "MNT - Special Notes": "Regular meals, social support, therapy, exercise to boost neurotransmitters.",
    "Ayurvedic View": "Vata/Kapha or Vata/Pitta depending on presentation; grounding foods helpful.",
    "Dosha Dominance": "Vata + Kapha",
    "Lifestyle & Yogic Guidance": "Movement, sunlight, social connection, mindfulness practices.",
    "Healing Affirmation": "Affirmation: I am held, I am healing, and my mind grows lighter each day."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Pregnancy Nutrition",
    "Definition / Etiology": "Nutritional needs during pregnancy to support fetal growth and maternal health.",
    "Clinical Goals": "Support maternal weight gain, fetal development, prevent deficiencies (iron, folate).",
    "MNT - Macronutrients": "Increased calories +300 kcal in 2nd/3rd trimester; Protein 1.1 g/kg; balanced carbs & fats.",
    "MNT - Micronutrients": "Folate, Iron, Calcium, Vitamin D, B12, Iodine.",
    "MNT - Fluids & Electrolytes": "Hydration increased; avoid excessive caffeine and alcohol.",
    "MNT - Special Notes": "Frequent meals, small snacks, avoid high-mercury fish, ensure prenatal supplementation.",
    "Ayurvedic View": "Kapha + Pitta considerations; nourishing warm foods like ghee, dates, millets.",
    "Dosha Dominance": "Kapha + Pitta",
    "Lifestyle & Yogic Guidance": "Gentle prenatal yoga, pelvic floor care, sleep, emotional support.",
    "Healing Affirmation": "Affirmation: I nourish my baby and myself with deep love and wise choices."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Lactation Nutrition",
    "Definition / Etiology": "Nutrition to support milk production and maternal recovery post-partum.",
    "Clinical Goals": "Ensure adequate calories, fluid and nutrients to support lactation and maternal health.",
    "MNT - Macronutrients": "Extra ~500 kcal/day initially; Protein 1.1/1.3 g/kg; balanced carbs & fats.",
    "MNT - Micronutrients": "Iron, Calcium, Vitamin D, B12, Omega-3.",
    "MNT - Fluids & Electrolytes": "Hydration increased; drink fluids regularly when feeding.",
    "MNT - Special Notes": "Frequent nutrient-dense meals, galactagogues as needed, monitor maternal depletion.",
    "Ayurvedic View": "Kapha supportive foods, warm nourishing diet, fenugreek/ajwain under guidance.",
    "Dosha Dominance": "Kapha",
    "Lifestyle & Yogic Guidance": "Rest, support network, gentle postnatal yoga, feeding routines.",
    "Healing Affirmation": "Affirmation: My body gives nourishing milk with ease. I am supported and strong."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Geriatric Nutrition",
    "Definition / Etiology": "Nutrition for older adults focusing on preserving function, preventing sarcopenia and deficiencies.",
    "Clinical Goals": "Maintain muscle mass, bone health, cognitive function and prevent malnutrition.",
    "MNT - Macronutrients": "Adequate calories, Protein 1.0/1.2 g/kg, fiber for bowel health, healthy fats.",
    "MNT - Micronutrients": "Vitamin D, B12, Calcium, Zinc, Protein-related nutrients.",
    "MNT - Fluids & Electrolytes": "Ensure hydration; monitor medications that affect fluids/electrolytes.",
    "MNT - Special Notes": "Texture modification if needed, nutrient-dense meals, fall prevention nutrition.",
    "Ayurvedic View": "Vata predominance with aging; nourishing, warm, easy-to-digest foods like ghee and kitchari.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Resistance training, balance exercises, social meals, cognitive stimulation.",
    "Healing Affirmation": "Affirmation: I age with grace; my body is strong and nourished."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Sports Nutrition",
    "Definition / Etiology": "Nutrition to optimize performance, recovery and body composition for athletes.",
    "Clinical Goals": "Fuel performance, optimize recovery, periodize nutrition with training.",
    "MNT - Macronutrients": "Carbs timing around training, Protein 1.4/2.0 g/kg for strength athletes, Fat 20/30%.",
    "MNT - Micronutrients": "Iron, Vitamin D, Calcium, B-complex, Electrolytes, Zinc.",
    "MNT - Fluids & Electrolytes": "Fluids & electrolyte replacement during/after training.",
    "MNT - Special Notes": "Periodized carbohydrate intake, protein distribution, supplements as needed.",
    "Ayurvedic View": "Depends on athlete; focus on grounding post-workout foods and herbs like ashwagandha.",
    "Dosha Dominance": "Depends",
    "Lifestyle & Yogic Guidance": "Sport-specific training nutrition, recovery protocols, sleep and periodization.",
    "Healing Affirmation": "Affirmation: I strengthen and recover with intention; my body performs with joy."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Pediatric Nutrition",
    "Definition / Etiology": "Nutrition supporting growth and development in infants and children.",
    "Clinical Goals": "Support age-appropriate growth, prevent deficiencies, encourage healthy eating habits.",
    "MNT - Macronutrients": "Age-appropriate energy, Protein 1.0/1.5 g/kg depending on age, healthy fats for brain.",
    "MNT - Micronutrients": "Iron (esp. infants), Vitamin D, Zinc, B12, Calcium.",
    "MNT - Fluids & Electrolytes": "Ensure adequate fluids; monitor for dehydration with illness.",
    "MNT - Special Notes": "Breastfeeding support, weaning guidance, nutrient-dense snacks, avoid added sugar.",
    "Ayurvedic View": "Vata tendency in children; warm, nourishing foods, ghee, mild spices.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Routines, family meals, play and activity, sleep hygiene.",
    "Healing Affirmation": "Affirmation: My child grows strong, curious, and joyful with nourishing food."
  },
  {
    "Category": "Special Populations",
    "Disorder Name": "Adolescent Nutrition",
    "Definition / Etiology": "Nutrition for teens supporting growth, hormonal changes and cognitive development.",
    "Clinical Goals": "Support puberty-related growth, bone accrual, and healthy body image.",
    "MNT - Macronutrients": "Increased calories for growth spurts; Protein 1.0/1.5 g/kg, calcium-rich foods.",
    "MNT - Micronutrients": "Iron (girls), Calcium, Vitamin D, B-vitamins, Zinc.",
    "MNT - Fluids & Electrolytes": "Hydration for activity; counsel on safe dieting behaviors.",
    "MNT - Special Notes": "Encourage balanced meals, snack planning, body positivity education.",
    "Ayurvedic View": "Pitta and Vata fluctuations; balancing cooling foods and grounding snacks.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Physical activity, education on body image, sleep regulation.",
    "Healing Affirmation": "Affirmation: I am growing with strength and confidence. My body is perfect for my journey."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Vitamin A Deficiency",
    "Definition / Etiology": "Low vitamin A leading to impaired vision and immunity.",
    "Clinical Goals": "Restore vitamin A stores, improve vision and mucosal health.",
    "MNT - Macronutrients": "Include carotene-rich foods; ensure dietary fat for absorption.",
    "MNT - Micronutrients": "Vitamin A (beta-carotene sources)",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Use carrots, sweet potato, leafy greens, ghee to enhance absorption.",
    "Ayurvedic View": "Pitta/Vata imbalance; amla and ghee supportive.",
    "Dosha Dominance": "Pitta + Vata",
    "Lifestyle & Yogic Guidance": "Sunlight, balanced meals, avoid excessive processed food.",
    "Healing Affirmation": "Affirmation: I see life clearly and vibrantly."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Vitamin D Deficiency",
    "Definition / Etiology": "Low vitamin D affecting bone health, immunity and mood.",
    "Clinical Goals": "Restore vitamin D levels, improve bone and muscle function.",
    "MNT - Macronutrients": "Ensure adequate dietary calcium and protein.",
    "MNT - Micronutrients": "Vitamin D, Calcium, Magnesium.",
    "MNT - Fluids & Electrolytes": "Normal fluids; encourage sunlight exposure.",
    "MNT - Special Notes": "Sunlight exposure, mushrooms, fortified foods, supplementation as needed.",
    "Ayurvedic View": "Vata imbalance with weakness; sesame and ghee nourishing.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Sunlight 15/20 min daily, weight-bearing exercise.",
    "Healing Affirmation": "Affirmation: I absorb the light and grow stronger each day."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Vitamin E Deficiency",
    "Definition / Etiology": "Rare; due to fat malabsorption causing oxidative stress.",
    "Clinical Goals": "Restore antioxidant status and prevent neurologic symptoms.",
    "MNT - Macronutrients": "Healthy fats to aid absorption.",
    "MNT - Micronutrients": "Vitamin E from nuts, seeds, oils.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Include nuts, seeds, spinach; address underlying fat malabsorption.",
    "Ayurvedic View": "Pitta balance supportive with cooling oils and coconut.",
    "Dosha Dominance": "Pitta",
    "Lifestyle & Yogic Guidance": "Balanced diet, antioxidant-rich foods.",
    "Healing Affirmation": "Affirmation: My body is protected by gentle strength and resilience."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Vitamin K Deficiency",
    "Definition / Etiology": "Impaired clotting and bone health due to low vitamin K.",
    "Clinical Goals": "Restore coagulation factors and support bone matrix.",
    "MNT - Macronutrients": "Leafy greens and dietary fats for absorption.",
    "MNT - Micronutrients": "Vitamin K (leafy greens, fermented foods).",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Include spinach, kale, fermented foods, ghee for absorption.",
    "Ayurvedic View": "Vata/Pitta balance.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Include greens regularly; monitor with anticoagulant therapy.",
    "Healing Affirmation": "Affirmation: I heal and flow in harmony."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Vitamin B12 Deficiency",
    "Definition / Etiology": "Common in vegetarians; leads to anemia and neuropathy.",
    "Clinical Goals": "Restore B12 stores, improve neurological and hematologic function.",
    "MNT - Macronutrients": "Include fortified foods and adequate protein.",
    "MNT - Micronutrients": "Vitamin B12 (fortified foods, supplements), Folate supportive.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Consider supplementation for strict vegetarians; check intrinsic factor causes.",
    "Ayurvedic View": "Vata/Pitta vulnerabilities; warm nourishing diet.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Monitor levels, supplementation, neuro follow-up.",
    "Healing Affirmation": "Affirmation: Energy flows through every cell; I am vibrant."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Folate (Vitamin B9) Deficiency",
    "Definition / Etiology": "Leads to megaloblastic anemia and in pregnancy neural tube defects.",
    "Clinical Goals": "Restore folate stores, particularly important in pregnancy.",
    "MNT - Macronutrients": "Include folate-rich foods with balanced macronutrients.",
    "MNT - Micronutrients": "Folate (leafy greens, legumes), B12 supportive.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Ensure adequate intake in pregnancy; use cooked greens if absorp issues.",
    "Ayurvedic View": "Pitta/Vata supportive herbs like amla.",
    "Dosha Dominance": "Pitta + Vata",
    "Lifestyle & Yogic Guidance": "Prenatal planning, supplementation as needed.",
    "Healing Affirmation": "Affirmation: I grow and create with ease and abundance."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Iron Deficiency",
    "Definition / Etiology": "Common cause of anemia due to poor intake, loss, or malabsorption.",
    "Clinical Goals": "Restore iron stores and hemoglobin, correct symptoms.",
    "MNT - Macronutrients": "Include iron-rich meals with vitamin C at meals.",
    "MNT - Micronutrients": "Iron, Vitamin C, Folate, B12 where needed.",
    "MNT - Fluids & Electrolytes": "Normal fluids; avoid tea/coffee with meals.",
    "MNT - Special Notes": "Use legumes, jaggery, sesame; enhance absorption with vitamin C.",
    "Ayurvedic View": "Vata + Pitta patterns; amla supportive.",
    "Dosha Dominance": "Vata + Pitta",
    "Lifestyle & Yogic Guidance": "Regular monitoring, dietary strategies and supplementation when needed.",
    "Healing Affirmation": "Affirmation: My blood is rich with life and vitality."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Zinc Deficiency",
    "Definition / Etiology": "Affects immunity, wound healing, and growth.",
    "Clinical Goals": "Restore zinc status to support immunity and repair.",
    "MNT - Macronutrients": "Include zinc-rich plant foods and protein.",
    "MNT - Micronutrients": "Zinc (pumpkin seeds, legumes, nuts), B-complex supportive.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Address malabsorption; include seeds and legumes.",
    "Ayurvedic View": "Pitta/Kapha supportive foods and turmeric.",
    "Dosha Dominance": "Pitta + Kapha",
    "Lifestyle & Yogic Guidance": "Balanced meals with protein and seeds regularly.",
    "Healing Affirmation": "Affirmation: I renew and restore with natural strength."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Calcium Deficiency",
    "Definition / Etiology": "Leads to poor bone health, cramps, and in severe cases osteopenia/osteoporosis.",
    "Clinical Goals": "Restore calcium stores and support bone health.",
    "MNT - Macronutrients": "Include calcium-rich foods with vitamin D and protein.",
    "MNT - Micronutrients": "Calcium, Vitamin D, Magnesium, Vitamin K2.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Include ragi, sesame, dairy if tolerated, green leafy vegetables.",
    "Ayurvedic View": "Vata imbalance; grounding foods like sesame and milk.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Weight-bearing exercise, sunlight and calcium-rich foods.",
    "Healing Affirmation": "Affirmation: I am strong, stable and grounded."
  },
  {
    "Category": "Micronutrient Deficiency",
    "Disorder Name": "Iodine Deficiency",
    "Definition / Etiology": "Leads to goiter, hypothyroidism and developmental issues in pregnancy.",
    "Clinical Goals": "Ensure adequate iodine to support thyroid and development.",
    "MNT - Macronutrients": "Use iodized salt and iodine-containing foods.",
    "MNT - Micronutrients": "Iodine (iodized salt, seaweed), Selenium supportive.",
    "MNT - Fluids & Electrolytes": "Normal fluids.",
    "MNT - Special Notes": "Promote iodized salt use; caution with excessive seaweed in pregnancy.",
    "Ayurvedic View": "Kapha/Vata considerations; gentle sea-sourced foods.",
    "Dosha Dominance": "Kapha + Vata",
    "Lifestyle & Yogic Guidance": "Monitor intake; ensure safe levels especially in pregnancy.",
    "Healing Affirmation": "Affirmation: I express my truth clearly and confidently."
  },
  {
    "Category": "Integrative / Functional",
    "Disorder Name": "Gut Microbiome Imbalance (Dysbiosis)",
    "Definition / Etiology": "Altered gut microbial composition affecting digestion, immunity and metabolism.",
    "Clinical Goals": "Restore healthy microbiome diversity, reduce dysbiosis symptoms, support gut barrier.",
    "MNT - Macronutrients": "Balanced macronutrients with prebiotic fibers and adequate protein.",
    "MNT - Micronutrients": "Prebiotic fibers, Vitamin D, Zinc, Short-chain fatty acid support.",
    "MNT - Fluids & Electrolytes": "Hydration supports bowel function; avoid excessive alcohol.",
    "MNT - Special Notes": "Use fermented foods, prebiotics, probiotics, fiber diversity and minimize antibiotics when possible.",
    "Ayurvedic View": "Vata imbalance often with dysbiosis; use triphala ginger and fennel for digestion.",
    "Dosha Dominance": "Vata",
    "Lifestyle & Yogic Guidance": "Stress reduction, sleep, gradual dietary fiber increase, fermented foods if tolerated.",
    "Healing Affirmation": "Affirmation: My inner garden blooms with balance and vitality."
  },
  {
    "Category": "Integrative / Functional",
    "Disorder Name": "Detoxification & Liver Cleanse Nutrition (Holistic Module)",
    "Definition / Etiology": "Structured nutritional approaches to support liver detox pathways and overall metabolic cleansing.",
    "Clinical Goals": "Support liver detox, antioxidant capacity, safe elimination and metabolic reset.",
    "MNT - Macronutrients": "Balanced macronutrients; emphasize complex carbs, adequate protein, healthy fats for phase II detox support.",
    "MNT - Micronutrients": "Glutathione precursors (cysteine), Selenium, B-complex, Vitamin C, Magnesium.",
    "MNT - Fluids & Electrolytes": "Adequate fluids; support renal clearance and bowel regularity.",
    "MNT - Special Notes": "Use antioxidant foods, cruciferous vegetables cooked, turmeric, adequate protein to support conjugation pathways.",
    "Ayurvedic View": "Pitta + Kapha considerations; gentle herbs like coriander, turmeric, amla, kutki under supervision.",
    "Dosha Dominance": "Pitta + Kapha",
    "Lifestyle & Yogic Guidance": "Avoid prolonged fasting without supervision; gentle movement, dry brushing, sauna if appropriate.",
    "Healing Affirmation": "Affirmation: I cleanse gently and regenerate with loving care."
  }
]